# NextSObj

## Description
Function NextSObj returns the next selected object in a list. If the end of the list is reached, the function returns NIL.&lt;BR&gt;
&lt;BR&gt;

```pascal
FUNCTION NextSObj(h : HANDLE) : HANDLE;
```

```python

def vs.NextSObj(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Version
Availability: from MiniCAD
## Category
* Document List Handling